app/controllers/api/educations_controller.rb

SELECT "educations".* FROM "educations"
---
    def index
        @educations= Education.all

INSERT INTO "educations" ("user_id", "school", "field_of_study", "start_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 21], ["school", "Middle School"], ["field_of_study", "Hi"], ["start_date", "2021-05-05"], ["created_at", "2021-05-19 22:22:19.098453"], ["updated_at", "2021-05-19 22:22:19.098453"]]
---
    def create
        @education=Education.new(edu_params)
        @education.user_id= current_user.id

        if @education.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
    def show
        @education= Education.includes(:user).find_by(id: params[:id])

SELECT  "educations".* FROM "educations" WHERE "educations"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "educations" WHERE "educations"."id" = $1  [["id", 9]]
---
    def destroy
        @education= Education.find_by(id: params[:id])

        if @education.destroy