app/controllers/api/posts_controller.rb

INSERT INTO "posts" ("body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "this is eevee"], ["author_id", 1], ["created_at", "2021-05-13 00:47:38.458206"], ["updated_at", "2021-05-13 00:47:38.458206"]]
---
    def create
        # debugger
        @post= Post.new(post_params)
        @post.author_id= current_user.id
        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "Ive been having a rough day will this work"], ["updated_at", "2021-05-18 17:57:30.780014"], ["id", 54]]
---
    def update
        # debugger
        @post = Post.find_by(id: params[:id])
        if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 55], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 55]]
---
    def destroy
        @post= Post.find_by(id: params[:id])

        if @post.destroy