app/controllers/api/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users= User.all;

INSERT INTO "users" ("email", "password_digest", "session_token", "bio", "location", "job_title", "created_at", "updated_at", "full_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
UPDATE "users" SET "bio" = $1, "location" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["bio", "Im testing this out "], ["location", "New York"], ["updated_at", "2021-06-21 15:56:39.363892"], ["id", 25]]
---
  def update
    @user=User.find_by(id: params[:id])
    if @user.update(user_params)